## [Workerpool demo](https://daniellem97.app.spacelift.io/stack/workerpool-demo/run/01JCG29TC30YSF9SH3R7STEVVD) plan logs

<details>
<summary>Click here to expand</summary>

```
...
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
This is a sample log entry to test the system's handling of log verbosity, repeated multiple times to observe how it affects log processing and readability.
module.my_workerpool.module.asg.data.aws_default_tags.current: Reading...
module.my_workerpool.data.aws_region.this: Reading...
module.my_workerpool.module.asg.data.aws_partition.current: Reading...
module.my_workerpool.data.aws_ami.this: Reading...
module.my_workerpool.module.asg.data.aws_default_tags.current: Read complete after 0s [id=aws]
module.my_workerpool.data.aws_region.this: Read complete after 0s [id=eu-west-1]
module.my_workerpool.module.asg.data.aws_partition.current: Read complete after 0s [id=aws]
module.my_workerpool.data.aws_ami.this: Read complete after 0s [id=ami-0078a3539518eea80]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # module.my_workerpool.data.archive_file.binary[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "archive_file" "binary" {
      + id                  = (known after apply)
      + output_base64sha256 = (known after apply)
      + output_base64sha512 = (known after apply)
      + output_md5          = (known after apply)
      + output_path         = "ec2-workerpool-autoscaler_v0.2.0.zip"
      + output_sha          = (known after apply)
      + output_sha256       = (known after apply)
      + output_sha512       = (known after apply)
      + output_size         = (known after apply)
      + source_file         = "lambda/bootstrap"
      + type                = "zip"
    }

  # module.my_workerpool.data.aws_iam_policy_document.autoscaler[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "autoscaler" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "xray:PutTelemetryRecords",
              + "xray:PutTraceSegments",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "autoscaling:DescribeAutoScalingGroups",
              + "autoscaling:DetachInstances",
              + "autoscaling:SetDesiredCapacity",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "ec2:DescribeInstances",
              + "ec2:TerminateInstances",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "ssm:GetParameter",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
        }
    }

  # module.my_workerpool.aws_cloudwatch_event_rule.scheduling[0] will be created
  + resource "aws_cloudwatch_event_rule" "scheduling" {
      + arn                 = (known after apply)
      + description         = "Spacelift autoscaler scheduling for worker pool 01HNK02PZAPP4YFH4C0JE2J8Y4"
      + event_bus_name      = "default"
      + force_destroy       = false
      + id                  = (known after apply)
      + name                = "sp5ft-01HNK02PZAPP4YFH4C0JE2J8Y4-ec2-autoscaler"
      + name_prefix         = (known after apply)
      + schedule_expression = "rate(1 minute)"
      + tags_all            = (known after apply)
    }

  # module.my_workerpool.aws_cloudwatch_event_target.scheduling[0] will be created
  + resource "aws_cloudwatch_event_target" "scheduling" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + force_destroy  = false
      + id             = (known after apply)
      + rule           = "sp5ft-01HNK02PZAPP4YFH4C0JE2J8Y4-ec2-autoscaler"
      + target_id      = (known after apply)
    }

  # module.my_workerpool.aws_cloudwatch_log_group.log_group[0] will be created
  + resource "aws_cloudwatch_log_group" "log_group" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/sp5ft-01HNK02PZAPP4YFH4C0JE2J8Y4-ec2-autoscaler"
      + name_prefix       = (known after apply)
      + retention_in_days = 7
      + skip_destroy      = false
      + tags_all          = (known after apply)
    }

  # module.my_workerpool.aws_iam_instance_profile.this will be created
  + resource "aws_iam_instance_profile" "this" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = "sp5ft-01HNK02PZAPP4YFH4C0JE2J8Y4"
      + name_prefix = (known after apply)
      + path        = "/"
      + role        = "sp5ft-01HNK02PZAPP4YFH4C0JE2J8Y4"
      + tags_all    = (known after apply)
      + unique_id   = (known after apply)
    }

  # module.my_workerpool.aws_iam_role.autoscaler[0] will be created
  + resource "aws_iam_role" "autoscaler" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "sp5ft-01HNK02PZAPP4YFH4C0JE2J8Y4-ec2-autoscaler"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = "ec2-autoscaler-01HNK02PZAPP4YFH4C0JE2J8Y4"
          + policy = (known after apply)
        }
    }

  # module.my_workerpool.aws_iam_role.this[0] will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "sp5ft-01HNK02PZAPP4YFH4C0JE2J8Y4"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # module.my_workerpool.aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonSSMManagedInstanceCore"] will be created
  + resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonSSMManagedInstanceCore"
      + role       = "sp5ft-01HNK02PZAPP4YFH4C0JE2J8Y4"
    }

  # module.my_workerpool.aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AutoScalingReadOnlyAccess"] will be created
  + resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AutoScalingReadOnlyAccess"
      + role       = "sp5ft-01HNK02PZAPP4YFH4C0JE2J8Y4"
    }

  # module.my_workerpool.aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/CloudWatchAgentServerPolicy"] will be created
  + resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/CloudWatchAgentServerPolicy"
      + role       = "sp5ft-01HNK02PZAPP4YFH4C0JE2J8Y4"
    }

  # module.my_workerpool.aws_lambda_function.autoscaler[0] will be created
  + resource "aws_lambda_function" "autoscaler" {
      + architectures                  = [
          + "x86_64",
        ]
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + filename                       = "ec2-workerpool-autoscaler_v0.2.0.zip"
      + function_name                  = "sp5ft-01HNK02PZAPP4YFH4C0JE2J8Y4-ec2-autoscaler"
      + handler                        = "bootstrap"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "provided.al2"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 3
      + version                        = (known after apply)

      + environment {
          + variables = (known after apply)
        }

      + tracing_config {
          + mode = "Active"
        }
    }

  # module.my_workerpool.aws_lambda_permission.allow_cloudwatch_to_call_lambda[0] will be created
  + resource "aws_lambda_permission" "allow_cloudwatch_to_call_lambda" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "sp5ft-01HNK02PZAPP4YFH4C0JE2J8Y4-ec2-autoscaler"
      + id                  = (known after apply)
      + principal           = "events.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "AllowExecutionFromCloudWatch"
      + statement_id_prefix = (known after apply)
    }

  # module.my_workerpool.aws_ssm_parameter.spacelift_api_key_secret[0] will be created
  + resource "aws_ssm_parameter" "spacelift_api_key_secret" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/sp5ft-01HNK02PZAPP4YFH4C0JE2J8Y4-ec2-autoscaler/spacelift-api-secret-01HNK02PZAPP4YFH4C0JE2J8Y4"
      + tags_all       = (known after apply)
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # module.my_workerpool.null_resource.download[0] will be created
  + resource "null_resource" "download" {
      + id       = (known after apply)
      + triggers = {
          + "now" = (known after apply)
        }
    }

  # module.my_workerpool.module.asg.aws_autoscaling_group.this[0] will be created
  + resource "aws_autoscaling_group" "this" {
      + arn                              = (known after apply)
      + availability_zones               = (known after apply)
      + default_cooldown                 = 10
      + desired_capacity                 = (known after apply)
      + enabled_metrics                  = [
          + "GroupDesiredCapacity",
          + "GroupInServiceInstances",
          + "GroupMaxSize",
          + "GroupMinSize",
          + "GroupPendingInstances",
          + "GroupStandbyInstances",
          + "GroupTerminatingInstances",
          + "GroupTotalInstances",
        ]
      + force_delete                     = false
      + force_delete_warm_pool           = false
      + health_check_grace_period        = 30
      + health_check_type                = "EC2"
      + id                               = (known after apply)
      + ignore_failed_scaling_activities = false
      + load_balancers                   = (known after apply)
      + max_size                         = 3
      + metrics_granularity              = "1Minute"
      + min_size                         = 1
      + name                             = (known after apply)
      + name_prefix                      = "sp5ft-01HNK02PZAPP4YFH4C0JE2J8Y4-"
      + predicted_capacity               = (known after apply)
      + protect_from_scale_in            = false
      + service_linked_role_arn          = (known after apply)
      + target_group_arns                = (known after apply)
      + termination_policies             = [
          + "OldestLaunchTemplate",
          + "OldestInstance",
        ]
      + vpc_zone_identifier              = [
          + "subnet-019e7beb5cb989c8c",
        ]
      + wait_for_capacity_timeout        = "0"
      + warm_pool_size                   = (known after apply)

      + launch_template {
          + id      = (known after apply)
          + name    = (known after apply)
          + version = (known after apply)
        }

      + tag {
          + key                 = "Name"
          + propagate_at_launch = true
          + value               = "sp5ft-01HNK02PZAPP4YFH4C0JE2J8Y4"
        }
      + tag {
          + key                 = "WorkerPoolID"
          + propagate_at_launch = true
          + value               = "01HNK02PZAPP4YFH4C0JE2J8Y4"
        }

      + timeouts {}
    }

  # module.my_workerpool.module.asg.aws_launch_template.this[0] will be created
  + resource "aws_launch_template" "this" {
      + arn                    = (known after apply)
      + default_version        = (known after apply)
      + id                     = (known after apply)
      + image_id               = "ami-0078a3539518eea80"
      + instance_type          = "t3.small"
      + latest_version         = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "sp5ft-01HNK02PZAPP4YFH4C0JE2J8Y4-"
      + tags                   = {
          + "WorkerPoolID" = "01HNK02PZAPP4YFH4C0JE2J8Y4"
        }
      + tags_all               = {
          + "WorkerPoolID" = "01HNK02PZAPP4YFH4C0JE2J8Y4"
        }
      + user_data              = "IyEvYmluL2Jhc2gKCnNwYWNlbGlmdCAoKSB7KApzZXQgLWUKCmV4cG9ydCBTUEFDRUxJRlRfVE9LRU49ImV5SmljbTlyWlhJaU9uc2laVzVrY0c5cGJuUWlPaUpoY2pNMGVuUmxlR3MxTTNGdUxXRjBjeTVwYjNRdVpYVXRkMlZ6ZEMweExtRnRZWHB2Ym1GM2N5NWpiMjBpTENKd2RXSnNhWE5vWDJOb1lXNXVaV3hmWm05eWJXRjBJam9pYzNCaFkyVnNhV1owTDNkeWFYUmxiMjVzZVM4d01VaE9TekF5VUZwQlVGQTBXVVpJTkVNd1NrVXlTamhaTkM4bGN5SXNJbk4xWW5OamNtbGlaVjlqYUdGdWJtVnNYMlp2Y20xaGRDSTZJbk53WVdObGJHbG1kQzl5WldGa2IyNXNlUzh3TVVoT1N6QXlVRnBCVUZBMFdVWklORU13U2tVeVNqaFpOQzhsY3lKOUxDSndiMjlzWDJObGNuUWlPaUl0TFMwdExVSkZSMGxPSUVORlVsUkpSa2xEUVZSRkxTMHRMUzFjYmsxSlNVVjNSRU5EUVRacFowRjNTVUpCWjBsVlpIbFJTelJDS3pkVmRXVXpNM3BCTTBoNGNVOUxVa05tY1dKVmQwUlJXVXBMYjFwSmFIWmpUa0ZSUlV4Y2JrSlJRWGRVVkVaTVRVVnJSMEV4VlVWRGQzaERVVmN4YUdWdE9YVkpSbVJzV1dsQ1ZGcFlTakpoVjA1c1kzbENVRkJWUm5SWldIQjJZbWsxYW1JeU1HZGNibE5YTldwTWFVSk5VRlpPYkZsWVVqQmlSMVZuVlRGUk9WWXlSbnBoUjJ4MVdqTlNkbUpwUWtSUVZsWlVUVUkwV0VSVVNUQk5SRWwzVFZSRk5FNUVZekJjYmsxV2IxaEVWRkUxVFZSSmVrMVVTWHBPVkdzeFQxWnZkMmRaVVhoRGVrRktRbWRPVmtKQldWUkJhMnhHVFZKRmQwUjNXVVJXVVZGSlJFRm9SVmxYTlhCY2JscFhlSE5hVkVWUVRVRXdSMEV4VlVWQ2QzZEhVa2hXYVdKSGJIVk5VWE4zUTFGWlJGWlJVVXRFUVVwVVZFUkZURTFCYTBkQk1WVkZRM2QzUTFVd1ZYaGNia1ZFUVU5Q1owNVdRa0ZOVFVJd1VtaGliV3hzWWtkVmVFcFVRV3BDWjJ0eGFHdHBSemwzTUVKRFVVVlhSbTFTYUdKdGJHeGlSM2hzVFVSbk0wNXJRbTVjYm1KWFJuQmlRelZxWWpJd2QyZG5TV2xOUVRCSFExTnhSMU5KWWpORVVVVkNRVkZWUVVFMFNVTkVkMEYzWjJkSlMwRnZTVU5CVVVOamVEVlpSMU5HYkZwY2JtVm1VMkp2VlZWRFNuRldOMmwxUm1sRUt6VTRiMGhMUVRsUmNHaEtNR3cyZDNOMU5qY3ZVMUpPWkdFMk1UVjBVa05uWWsxb2JWVmtiVU16VmtOSU1FZGNiakZQZHpSeFdHUm9VV1J2TWxKVWVtZFBZV2htWmpGREwxZzJOVWQ2UVN0emVFaHNSVXBsT0RZMmFYZEdSelZYUzJaVFdtVlVZMk5KWjBsalRIUTNRbVZjYm1zd1IwNDVhbGxQYlhscE4yZHplR2RPTWtnMWFWZHRNR3REZUZSU05UUllXazl1YVd3elIybDJTbkJHTjNCRlNuQXdPREJ0VFdvMlRVVnJLMkpsYzJOY2JpdFBRazAxVUVSbWVqVnRSRFZxTkdGUVZrNUZOM0JJU3pSSVltUjZVbVpMTkdwUWQwOHlVems1WkVKd05VcDZNamhqVHpWSWRGTnhVREJRWkZWWVJtRmNialpoVVRsU1F6Sm9ialJWZW5JeFEyZ3ZMMU0xVW1VeGRuUmtVRXRxUzNwdFExSlNRVVZxUm5GcFNGRlNVM3AzVUVkdFNqSjZkbkJIYlVOWVVsaFhkM0JjYm5OeVlrcEVWRUV3YkRsNk5rUnhjemd3VVVOSUx5dFhNRmRsTmt0cU16SlpSV0ZTZFhsUFRHRmtOVWs1VkVwVGNtSnVNMEYzU0dwVE9GUjBjWE55UVZwY2JtdHRaVlpMU0hGd1FrWnBUbWhOWlV4SFNYZHVVRlpKVHpOeVJVTlpPVEptUjBGNFRIaE9jemt3WTFFNVVuVlVWblZ0TWpZeFEyUk5TVTl1YVZoNE1qVmNibTF5UzBOVlRIUmFPRkUzYVRWUmRHeExVVEJKYTA5eWMzWTVhbFFyYTFjM04wUnJTMFV3YjAxSkswdFVVMEZWUjNkSFdsTldRVEZCU1RSWVV6RklPRU5jYm1FMFNsWkdhbGxCVWxaSGJFMDRNVFptZW05T09DOHZhbnBEZDJabk5XSkpNME56U0haR2VXOTVkV3R1VEZCTVVuTkNhVGhrUlZoRFRXMXFkbVZOYzJ4Y2JrTlVMekl4TTBrd1NEaDBVRmg1TjJZMlVXUlBUVlpIYUZaWlNFNHJMM05yUzFBNEsyMHZjV3h1YVdvNWJVUmpNMWRNZWpFdlFXazFhVzFqVEZOU1prMWNiaTlCUW5VclV6VkJLMDlwTlVwamFHTm5XVk52UTBKMWNrRnFjalJSVnpOcmEzZEpSRUZSUVVKdk1rRjNXR3BCWmtKblRsWklVMDFGUjBSQlYyZENVM0ZjYmtrM2NXZFpabTR4YTBJNGRqUlljRzg1YTFOMlVWUXdja2RxUVdSQ1owNVdTRkUwUlVablVWVk5LM2hIY2xneVFuZFpjVXRqYWpaME4xRXhkalpJUjFCY2JtUklaM2RFUVZsRVZsSXdWRUZSU0M5Q1FVbDNRVVJCVDBKblRsWklVVGhDUVdZNFJVSkJUVU5DTkVGM1JGRlpTa3R2V2tsb2RtTk9RVkZGVEVKUlFVUmNibWRuUlVKQlJuZHlWMnBhYkRWNlZGTllRV0pJWldoQk1uRjZXR3B1V1cxUmExVnpiVlJ6V1dkbVYySkplSGhsZUhoclVXUk1WVWd2WlRob2MxUnNjMVZjYmpGeWRrTXJia1JVYzB3NGNsVnJiM3BEUldkb1oxRlBTekJVTlRGM1dGRnJSVUV5TjNGRlZ6ZHdiRlo2ZDNnd05VMXBjRmM0UW5WVldXdFhXRVl3VkdwY2JsZDNiSGM1V0V0YWJsTk5ZblZZUm1sSGFGWTJWMmd2SzNKM01qWkNOMVJOYWpSUFFXTTJWamszVDJaMk1UaHdXWGd4ZERKNU5sWlJLMmd2VlVGVFQyNWNiamgxTDBWYWVWTTNWME54T1hKNVduTjNhR0pDUmtveFlVSTJkRVJoUkhsSVYzYzNaSFZ4U2tocFZWa3lRbEZOU1Zwb2JESkViVzVNTjJwd05GRlFaRVZjYmt4bFMwRm5ZMEptVm0wMVJGRjFaMGx1YkVaVE1tZGFaVzUzTDFwV2JUazVNemhTWWxSVmVWbGpMM1VyYkRCbE5YUnVXSFV6WTNvM1pqTkxXVTl5TUdwY2JuSTFZV2hCVTJ0VUszRkNjRm8zTVd3eFJYRnZhRmRhZWpkV1NUMWNiaTB0TFMwdFJVNUVJRU5GVWxSSlJrbERRVlJGTFMwdExTMWNiaUlzSW5kdmNtdGxjbDl3YjI5c1gzVnNhV1FpT2lJd01VaE9TekF5VUZwQlVGQTBXVVpJTkVNd1NrVXlTamhaTkNKOSIKZXhwb3J0IFNQQUNFTElGVF9QT09MX1BSSVZBVEVfS0VZPSJMUzB0TFMxQ1JVZEpUaUJRVWtsV1FWUkZJRXRGV1MwdExTMHRDazFKU1VwUlVVbENRVVJCVGtKbmEzRm9hMmxIT1hjd1FrRlJSVVpCUVZORFExTnpkMmRuYTI1QlowVkJRVzlKUTBGUlEyTjROVmxIVTBac1dtVm1VMklLYjFWVlEwcHhWamRwZFVacFJDczFPRzlJUzBFNVVYQm9TakJzTm5kemRUWTNMMU5TVG1SaE5qRTFkRkpEWjJKTmFHMVZaRzFETTFaRFNEQkhNVTkzTkFweFdHUm9VV1J2TWxKVWVtZFBZV2htWmpGREwxZzJOVWQ2UVN0emVFaHNSVXBsT0RZMmFYZEdSelZYUzJaVFdtVlVZMk5KWjBsalRIUTNRbVZyTUVkT0NqbHFXVTl0ZVdrM1ozTjRaMDR5U0RWcFYyMHdhME40VkZJMU5GaGFUMjVwYkROSGFYWktjRVkzY0VWS2NEQTRNRzFOYWpaTlJXc3JZbVZ6WXl0UFFrMEtOVkJFWm5vMWJVUTFhalJoVUZaT1JUZHdTRXMwU0dKa2VsSm1TelJxVUhkUE1sTTVPV1JDY0RWS2VqSTRZMDgxU0hSVGNWQXdVR1JWV0VaaE5tRlJPUXBTUXpKb2JqUlZlbkl4UTJndkwxTTFVbVV4ZG5Sa1VFdHFTM3B0UTFKU1FVVnFSbkZwU0ZGU1UzcDNVRWR0U2pKNmRuQkhiVU5ZVWxoWGQzQnpjbUpLQ2tSVVFUQnNPWG8yUkhGek9EQlJRMGd2SzFjd1YyVTJTMm96TWxsRllWSjFlVTlNWVdRMVNUbFVTbE55WW00elFYZElhbE00VkhSeGMzSkJXbXR0WlZZS1MwaHhjRUpHYVU1b1RXVk1SMGwzYmxCV1NVOHpja1ZEV1RreVprZEJlRXg0VG5NNU1HTlJPVkoxVkZaMWJUSTJNVU5rVFVsUGJtbFllREkxYlhKTFF3cFZUSFJhT0ZFM2FUVlJkR3hMVVRCSmEwOXljM1k1YWxRcmExYzNOMFJyUzBVd2IwMUpLMHRVVTBGVlIzZEhXbE5XUVRGQlNUUllVekZJT0VOaE5FcFdDa1pxV1VGU1ZrZHNUVGd4Tm1aNmIwNDRMeTlxZWtOM1ptYzFZa2t6UTNOSWRrWjViM2wxYTI1TVVFeFNjMEpwT0dSRldFTk5iV3AyWlUxemJFTlVMeklLTVROSk1FZzRkRkJZZVRkbU5sRmtUMDFXUjJoV1dVaE9LeTl6YTB0UU9DdHRMM0ZzYm1scU9XMUVZek5YVEhveEwwRnBOV2x0WTB4VFVtWk5MMEZDZFFvclV6VkJLMDlwTlVwamFHTm5XVk52UTBKMWNrRnFjalJSVnpOcmEzZEpSRUZSUVVKQmIwbERRVUp4VUcxaVVXZDROM0J1T1dVdmVqVXpkMUY2YUVwaUNrZG5iME5DZGxwdlVFWXpjWEJqUzBZMVIxZ3JORWxOWjB0bUx6YzNhRUZxWmxCWVEzcENiMVZZYzJObWVFRjNSMko1UVdOTVNsVkJOazhyTms0eGVtY0tZVUZ5V1RKa1UzSXZhVTFrT0RadFl6UnlOM3BZYkZGVlZsTTFXRUV2VVhScmVUQjFVRXhVV0ZkdVVIWlRia2hMZDJZclZERlNVbGM1VW5WUFdEa3dPQXB6UzBaUldVeElheTlPY1ZKWWJVVlNhbWhCUzJ0aVJra3hVVU56UlZSeWRIbDJZVzExVERKQ1kxQk5jVUZSTm5CcmNEWkxOek13TTJkRVRqWjFWbWh0Q2xKdWEzUnJTa1J4Um1oeldEUnBkRGRzY0RsU2NWWnFNbmgySzBSNVRGcFlLemwxSzFrNWJGZENkRTQ0SzIxT2FHRXJTSEZIVjBGcWVqbE9SVGhyTUhFS1ZUSXZUM0pGYUVST05VZHZZbGRSZDFwM05Xd3hWamw0WkZwMlJqSkdkMmh6WlVGb1MxUk9WbkEwVFZWUVluWXhjSFZDT1c1WlpqaFRkMFoxUWxGeE5BcFZlRTFaWlZGeEsyUTJaRzQyZW1GT1NFMUlRazFRYjFjNVdETlhka0ZPZEZSeWJuQnNTMmt6TTBGaGRGcE5WMFpSYldacFZsZzJTVlYwYVVFNFVrOUtDakV5Y21wbk1YbGhZMVpsVVdwMmQwMXZNVmw0VEdGMkt5c3lLMmhGVG01RFdETjJSRFZaVlZoU2REQlhiRlF2YmxVd2EwUnNNRWtyVjJsa1NXWTVibGdLY1hKRlFuVnlVWGNyYzNVNVYxVnJZV0ZXVWpaR2JFbFRNekU0YjJoRVVXVXdWR05oVFhKUlduaGtRMDVDZVUxV01FNXJhMFZNYmtOSE9HUnNSRlZ4VGdvd1dqRjNMMVpzYW5OSVluZHdRbGx6SzJWcFVFTjVjWHBwUTJSb1owbFJWRzFGZWpCVFoyZFRkVFYwZUhFMkwwRlhjRkFyVlVSaEsydG5WbTVhYkRGcUNrdFZZWE5sVDNKdVpISnlaMVp5VkhsbWJIcDNSR1ZtUlVzeVZIaDBlV0ZvY1dOblMzQlJWRWhOTldwNFRqbDBkVlp1YzJwWFltcFdOVzl3Y0djMlNWb0tRM2RhWjFKaVVuTlFRVnBFZUhkalJIWk5RM2hCYjBsQ1FWRkVUREZQTHk5WU1YTldhVTU1VTBwcWVtSkdWSFpyVDI5MlZ6aElRMkZLZVdOTFEyWmFOUXBuWTFOWk4yUm5VMmxVTTI0NGJUWkVRV2RtUTNKUlNtWlNlVmcxTUVwRlVVZGpSRGRXT0V4TU1tbFVUMVppZWs5WGVGTjFWVk4yVTBGVlZsTlBjRWxJQ25SMFRIcFVaRGMwVm14dVIxbGphM2N2TVdOUFNHcEtkMUpwU1hWRlNqZHpiVlpxU0ZCbVpsYzRaRFJwUmpCUlVuVnBWVm93YUZKVVRsbDVUV1pQV0UwS05XSnhaWGRWWW5oS1UwbGpkMEZsYUdzdmNYbHZWVzUxTVN0aFlsUlJTSHBGWlVaQk1GQm5SMGxuUTJKcGQzVjNjM1puY1VVNVRXbDZjR0p2Y3pab1l3cFBkVlZsY0RoMlpIQndZVXhITUhad1Vta3lVbTVKYWxkWkwwTjBURmROZGxnMVJEaHlTMWx1VFVkM00wWXlRM2gwV1ZCVk9UTk9WREJtYmswNWJGQTNDa0psWkdabU0zbHFWM013UkZkQmRrZHpkR2xCTVhwTksycFhSMUEzVkZocWEwUmxSMk52V2s5dFVTdFBVRU5tU2tGdlNVSkJVVVJGTlRod1puSm1aVTBLTWpacFRDc3hZM05pZWxsR1FVVXlSRFpCVlVOV1prTnlabXBTTmtzMlRERmlSbXRrTVhCMFZGbEtkVWR1VjFsdmRsaG5WRXhKTTNCVGNFSmtaVmxXTVFwU09IQXZSMlkwTXpOWVQyMVBVRXBrUmxaSVNrcDFZV2xvTDFCcWRpOUlRVlo0YmsxUFpGUlFTM0kwVUZFNFRXWkhUMHMzYURabVRrczRZMVZZVG5rM0NtNUlieXRtVWt0elNpOUpXRmRQY1VjeE9GTTFVMkpUZVVrNE9YWnFXRTlTVFZKVWNVczNMMDFUYjNOelRUZ3piMVpIYzFCd2RtWlNLMjlqWVM4M1Rqa0tVV0pwU2pncmRsWm9NemRyT1RZcmRsaE5NMGhrY1U5b2RUaFdZekZuVVRkU1ZIaElZemcxWWtsVk1rVnlkVll3UW1SMlJDdHhPVmRDUlROUVpFRTVaZ3BGT1ZObk1tTXhNbWQ1YzJ0c2FtRllVV2hJWlhSV2NqVTBNRFp3Y1dKTFMxYzVRVWxVVDJOWVJEVjZWVVV4TVhaeFdHd3JhVGw2VjIxTmFXSm5hM0pLQ21OM2NHZEdlaTh2YjJjNU4wRnZTVUpCUTJSbVMzcHBSblkzT1V0SU1tcDJhaXRQTVd3d2NpOWpRa2RHWjJkeFZYTXpja0kzSzFWTGFIVkpVRlo1VWtZS1pFUnlRVmhyTlZvM2QzWlJhRloyU1VRelRGRnpZVk5PYUZCU1NIZEhNMFkxYTFGbk1WbGFObTB5VlUxamN6RjFlREpuV25acGJGWlVRM2RLUWpVcmNRcGthemRYYUhCck4xTlRTMFl2VEVsd1MyVk5RaTlQUTNkM2FrSkRURkZTVFRGa05UVTFaMFZUYkhGWlJrdFVNMnhaZHl0cU9VaE9LMnRIZVc0MGNqaHFDbk5DU1dwdFdsaENWWEpTT0dGU05rVm1OWFpTTlZOWFFtUTJVV2RsVkdkbFF6QlpRVTV5VEdJM2QyMWFjVXhtV21Sa1ltWkdVVGg2Y0ZKM2JIZ3dRVFlLVGtkM1RWTnlOVEZsYzI1amJHRlljbmxuY0RWalQxbDFja2d2VTBSWmIxZFdWMFJUTWtNcllsbDVjVmt6WVV3NFRsTmpPVVZZTWpCYWVuWlJSVlpCZHdwamRHUktaelJVVHl0UWFubEhTV3BzYjBWdEwzaFNMeXQwUjNJME5XazFObUpGU0V0S2RHdERaMmRGUVZSQmMzZGlkVGhwYzFoWFRHcEVVVkJKU1hZMkNtdHpabWhLT1ZsT1UxTXJhbVZNWlU4d1RHWldaMWMzVFc4clpHcHhWRzFuUm5OaWJUQXdhMGt2UnpaNWFEWjRVMUZMWkZRd1ZURmxaVTlQZVN0RFVrRUtTeloyUjJabmFHcDNORzFSWmt0cFFXMXBOV2N3VDFaVFozcHhObGw0SzJkemQyZzJZa3RKVW5ac1lsQnBWRGhyTjFWd1NIWlFWR0pwVWt0SmFWcEJUQXAzVGxOSlJHNWtOVGxCZW5oRFprMXRaek5DWm1ReU1EZEtTWGx6ZWpseWFVVk1iMXBDVjJKRmVXaERlbTFLV20xWmVHcHdWM0pDY3podGIxQmFSRWRzQ2pSbmREa3ZMekphVVhwVloxVkxMMUp6ZERZNFZqVXJVR1pvUkU1WGQyaHlhRnBvT1RaUFlubFVjV1ZpTWpFMWFVcHZTWFZDV1hkR1F5OUlVbXhpYkcwS2FXZFRlRXBKTVZKc1Z6YzBjVnBWVG5Cb2VIaGFWbTAzTlRscE4xUnVObkpHU1ZFclF6UmxjRGhwVGxaelJreHJPWEJ1UmtKRVR6TnBRa041YlV0clpncDZVVXREUVZGQmJHRjFOV3hOZDFSaVVEZFVhMkp1TVRCb2FYUmtkV0pPYUhCb2QxTm5aa1pDU25CVU5rUnRPRWh3TjNsQ2NEUnRXRlowT0hkVVpIcEhDbVZWVG5OTllVdDZOelYxTlVrMGJISnZSRWhMUzJWYWRXeDFVMVowYkZGYWVVOVFiVlYyYkRCV0wzaHFUM1owWlcwd2NuWjNialJoVlV4WFpGUklSVWNLZFZNM2JtRXdTemRDUjBWRGVFbHphbnBCTlZWVlVuRm9ORGRxUW5wSVowSmpSR1IxTVVnclJHTmpUM0JTTm05RlYyRmpkRFpFVlRkbGJHSk5jalZaU0FwVFpERTNhSFJVYzBkRVVsUndaMUZUVFU1ekx6UklRemhtYkRod1VERTRkazlyYVRJM09IUnJVMFpwTTJ0T1pTdGtTVnBYV0hKRldWcDBjMGwwZW1KeUNqUlZSMGxEYlhkVFFUbHpUbEpSTXpWUmNXbHRkMVJ6T1hCWFFYZHRNR2RXZEUxQk9YcHpTbE01WVhkTFZFZHlNMFJCVjJsb2NGUnNUakJXV0hKSWVIb0tNbnBvWlc5cFRsaEpPSEJyUVVZMmVHVjNSbUozVFROeGJFNW5Md290TFMwdExVVk9SQ0JRVWtsV1FWUkZJRXRGV1MwdExTMHRDZz09IgpleHBvcnQgU1BBQ0VMSUZUX0RPQ0tFUl9DT05GSUdfRElSPSIvaG9tZS9zcGFjZWxpZnQvLmRvY2tlciIKCmN1cnJlbnRBcmNoPSQodW5hbWUgLW0pCgppZiBbWyAiJGN1cnJlbnRBcmNoIiAhPSAieDg2XzY0IiAmJiAiJGN1cnJlbnRBcmNoIiAhPSAiYWFyY2g2NCIgXV07IHRoZW4KICBlY2hvICJVbnN1cHBvcnRlZCBhcmNoaXRlY3R1cmU6ICRjdXJyZW50QXJjaCIgPj4gL3Zhci9sb2cvc3BhY2VsaWZ0L2Vycm9yLmxvZwogIHJldHVybiAxCmZpCgpiYXNlVVJMPSJodHRwczovL2Rvd25sb2Fkcy5zcGFjZWxpZnQuaW8vc3BhY2VsaWZ0LWxhdW5jaGVyIgpiaW5hcnlVUkw9JChwcmludGYgIiVzLSVzIiAiJGJhc2VVUkwiICIkY3VycmVudEFyY2giKQpzaGFTdW1VUkw9JChwcmludGYgIiVzLSVzXyVzIiAiJGJhc2VVUkwiICIkY3VycmVudEFyY2giICJTSEEyNTZTVU1TIikKc2hhU3VtU2lnVVJMPSQocHJpbnRmICIlcy0lc18lcyIgIiRiYXNlVVJMIiAiJGN1cnJlbnRBcmNoIiAiU0hBMjU2U1VNUy5zaWciKQoKZWNobyAiRG93bmxvYWRpbmcgU3BhY2VsaWZ0IGxhdW5jaGVyIiA+PiAvdmFyL2xvZy9zcGFjZWxpZnQvaW5mby5sb2cKY3VybCAiJGJpbmFyeVVSTCIgLS1vdXRwdXQgL3Vzci9iaW4vc3BhY2VsaWZ0LWxhdW5jaGVyIDI+Pi92YXIvbG9nL3NwYWNlbGlmdC9lcnJvci5sb2cKCmVjaG8gIkltcG9ydGluZyBwdWJsaWMgR1BHIGtleSIgPj4gL3Zhci9sb2cvc3BhY2VsaWZ0L2luZm8ubG9nCmN1cmwgaHR0cHM6Ly9rZXlzLm9wZW5wZ3Aub3JnL3Zrcy92MS9ieS1maW5nZXJwcmludC8xNzVGRDk3QUQyMzU4RUZFMDI4MzI5NzhFMzAyRkI1QUEyOUQ4OEY3IHwgZ3BnIC0taW1wb3J0IDI+Pi92YXIvbG9nL3NwYWNlbGlmdC9lcnJvci5sb2cKCmVjaG8gIkRvd25sb2FkaW5nIFNwYWNlbGlmdCBsYXVuY2hlciBjaGVja3N1bSBmaWxlIGFuZCBzaWduYXR1cmUiID4+IC92YXIvbG9nL3NwYWNlbGlmdC9pbmZvLmxvZwpjdXJsICIkc2hhU3VtVVJMIiAtLW91dHB1dCBzcGFjZWxpZnQtbGF1bmNoZXJfU0hBMjU2U1VNUyAyPj4vdmFyL2xvZy9zcGFjZWxpZnQvZXJyb3IubG9nCmN1cmwgIiRzaGFTdW1TaWdVUkwiIC0tb3V0cHV0IHNwYWNlbGlmdC1sYXVuY2hlcl9TSEEyNTZTVU1TLnNpZyAyPj4vdmFyL2xvZy9zcGFjZWxpZnQvZXJyb3IubG9nCgplY2hvICJWZXJpZnlpbmcgY2hlY2tzdW0gc2lnbmF0dXJlLi4uIiA+PiAvdmFyL2xvZy9zcGFjZWxpZnQvaW5mby5sb2cKZ3BnIC0tdmVyaWZ5IHNwYWNlbGlmdC1sYXVuY2hlcl9TSEEyNTZTVU1TLnNpZyAxPj4vdmFyL2xvZy9zcGFjZWxpZnQvaW5mby5sb2cgMj4+L3Zhci9sb2cvc3BhY2VsaWZ0L2Vycm9yLmxvZwoKcmV0U3RhdHVzPSQ/CmlmIFsgJHJldFN0YXR1cyAtZXEgMCBdOyB0aGVuCiAgICBlY2hvICJPS1whIiA+PiAvdmFyL2xvZy9zcGFjZWxpZnQvaW5mby5sb2cKZWxzZQogICAgcmV0dXJuICRyZXRTdGF0dXMKZmkKCkNIRUNLU1VNPSQoY3V0IC1mIDEgLWQgJyAnIHNwYWNlbGlmdC1sYXVuY2hlcl9TSEEyNTZTVU1TKQpybSBzcGFjZWxpZnQtbGF1bmNoZXJfU0hBMjU2U1VNUyBzcGFjZWxpZnQtbGF1bmNoZXJfU0hBMjU2U1VNUy5zaWcKTEFVTkNIRVJfU0hBPSQoc2hhMjU2c3VtIC91c3IvYmluL3NwYWNlbGlmdC1sYXVuY2hlciB8IGN1dCAtZiAxIC1kICcgJykKCmVjaG8gIlZlcmlmeWluZyBsYXVuY2hlciBiaW5hcnkuLi4iID4+IC92YXIvbG9nL3NwYWNlbGlmdC9pbmZvLmxvZwppZiBbWyAiJENIRUNLU1VNIiA9PSAiJExBVU5DSEVSX1NIQSIgXV07IHRoZW4KICBlY2hvICJPS1whIiA+PiAvdmFyL2xvZy9zcGFjZWxpZnQvaW5mby5sb2cKZWxzZQogIGVjaG8gIkNoZWNrc3VtIGFuZCBsYXVuY2hlciBiaW5hcnkgaGFzaCBkaWQgbm90IG1hdGNoIiA+PiAvdmFyL2xvZy9zcGFjZWxpZnQvZXJyb3IubG9nCiAgcmV0dXJuIDEKZmkKCmVjaG8gIk1ha2luZyB0aGUgU3BhY2VsaWZ0IGxhdW5jaGVyIGV4ZWN1dGFibGUiID4+IC92YXIvbG9nL3NwYWNlbGlmdC9pbmZvLmxvZwpjaG1vZCA3NTUgL3Vzci9iaW4vc3BhY2VsaWZ0LWxhdW5jaGVyIDI+Pi92YXIvbG9nL3NwYWNlbGlmdC9lcnJvci5sb2cKCmVjaG8gIlJldHJpZXZpbmcgRUMyIGluc3RhbmNlIGlkIGFuZCBBTUkgaWQiID4+IC92YXIvbG9nL3NwYWNlbGlmdC9pbmZvLmxvZwpleHBvcnQgU1BBQ0VMSUZUX01FVEFEQVRBX2luc3RhbmNlX2lkPSQoZWMyLW1ldGFkYXRhIC0taW5zdGFuY2UtaWQgfCBjdXQgLWQgJyAnIC1mMikKZXhwb3J0IFNQQUNFTElGVF9NRVRBREFUQV9hbWlfaWQ9JChlYzItbWV0YWRhdGEgLS1hbWktaWQgfCBjdXQgLWQgJyAnIC1mMikKCmVjaG8gIlJldHJpZXZpbmcgRUMyIEFTRyBJRCIgPj4gL3Zhci9sb2cvc3BhY2VsaWZ0L2luZm8ubG9nCmV4cG9ydCBTUEFDRUxJRlRfTUVUQURBVEFfYXNnX2lkPSQoYXdzIGF1dG9zY2FsaW5nIC0tcmVnaW9uPWV1LXdlc3QtMSBkZXNjcmliZS1hdXRvLXNjYWxpbmctaW5zdGFuY2VzIC0taW5zdGFuY2UtaWRzICRTUEFDRUxJRlRfTUVUQURBVEFfaW5zdGFuY2VfaWQgfCBqcSAtciAnLkF1dG9TY2FsaW5nSW5zdGFuY2VzWzBdLkF1dG9TY2FsaW5nR3JvdXBOYW1lJykKCmVjaG8gIlN0YXJ0aW5nIHRoZSBTcGFjZWxpZnQgYmluYXJ5IiA+PiAvdmFyL2xvZy9zcGFjZWxpZnQvaW5mby5sb2cKL3Vzci9iaW4vc3BhY2VsaWZ0LWxhdW5jaGVyIDE+Pi92YXIvbG9nL3NwYWNlbGlmdC9pbmZvLmxvZyAyPj4vdmFyL2xvZy9zcGFjZWxpZnQvZXJyb3IubG9nCil9CgpzcGFjZWxpZnQKZWNobyAiUG93ZXJpbmcgb2ZmIGluIDEyMCBzZWNvbmRzIiA+PiAvdmFyL2xvZy9zcGFjZWxpZnQvZXJyb3IubG9nCnNsZWVwIDEyMApwb3dlcm9mZgo="
      + vpc_security_group_ids = [
          + "sg-0a4bdc616a552213f",
        ]

      + block_device_mappings {
          + device_name = "/dev/xvda"
          + no_device   = "0"

          + ebs {
              + delete_on_termination = "true"
              + encrypted             = "false"
              + iops                  = (known after apply)
              + throughput            = (known after apply)
              + volume_size           = 40
              + volume_type           = "gp3"
            }
        }

      + metadata_options {
          + http_endpoint               = "enabled"
          + http_protocol_ipv6          = (known after apply)
          + http_put_response_hop_limit = 2
          + http_tokens                 = "required"
          + instance_metadata_tags      = (known after apply)
        }

      + monitoring {
          + enabled = true
        }
    }

Plan: 15 to add, 0 to change, 0 to destroy.

[01JCFWNMZS0ZN8Y09SVDVBWGKS] Changes are GO
[01JCFWNMZS0ZN8Y09SVDVBWGKS] Uploading the list of managed resources...
[01JCFWNMZS0ZN8Y09SVDVBWGKS] Please be aware that the run changes calculation includes output changes.
[01JCFWNMZS0ZN8Y09SVDVBWGKS] Resource list upload is GO
[01JCFWNMZS0ZN8Y09SVDVBWGKS] Generating JSON representation of the plan...
[01JCFWNMZS0ZN8Y09SVDVBWGKS] JSON representation is GO
[01JCFWNMZS0ZN8Y09SVDVBWGKS] Loading custom plan policy inputs...
[01JCFWNMZS0ZN8Y09SVDVBWGKS] 0 custom plan policy inputs found
[01JCFWNMZS0ZN8Y09SVDVBWGKS] No plan policies to evaluate
```

</details>